tap "productdevbook/tap"
# Fast and simple Node.js version manager
brew "fnm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Git on steroids
brew "git-town"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI to manage your clusters in style
brew "k9s"
# Run a Kubernetes cluster locally
brew "minikube"
# AI coding agent, built for the terminal
brew "opencode"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Search tool like grep and the silver searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Fast Fish-like syntax highlighting for zsh
brew "zsh-fast-syntax-highlighting"
# Enable Windows-like alt-tab
cask "alt-tab"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to manage periodic breaks
cask "breaktimer"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Monospaced typeface for source code
cask "font-fira-code"
# Monospaced typeface designed to be used where code is represented
cask "font-geist-mono"
cask "font-geist-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Grammarly for desktop
cask "grammarly-desktop"
# Screen recorder built with web technology
cask "kap"
# Customise mouse behavior
cask "linearmouse"
# App to write, plan, collaborate, and get organised
cask "notion"
# Menu bar app to find and kill processes running on open ports
cask "productdevbook/tap/portkiller"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Menu bar manager
cask "thaw"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
